**Pandas library is used to analyze data.**

*It provides numerous ways to retrieve and read in data.*
==we can convert data from csv, dictionaries, and Databases into dataframe.==

All the data representation is done using two datastructures:
1. Series
2. Dataframe

- *Series in pandas is a one-dimensional ndarray with an axis label. It means that in functionality, it is almost similar to a simple array.*

- Dataframe is the most important and useful data structure, which is used for almost all kind of data representation and manipulation in pandas. *Unlike numpy arrays (in general) a dataframe can contain heterogeneous data. Typically tabular data is represented using dataframes, which is analogous to an Excel sheet or a SQL table.*



- Heterogeneous data structures are data structures that contain diverse types of data, such as integers, doubles, and floats.

In [2]:
import pandas as pd

#  pd.DataFrame() reads data in form of dict, csv or db and converts it into known relational format.
data = [{'city': 'Bangalore', 'data': 5000},
        {'city': 'Delhi', 'data': 2000},
        {'city': 'mumbai', 'data': 5601}]
pd.DataFrame(data)

        city  data
0  Bangalore  5000
1      Delhi  2000
2     mumbai  5601

pd.read_csv() reads the csv file from the specified location and makes a df out of it.

In [3]:
city_data = pd.read_csv("C:\\Users\\Vasu\\Documents\\Notebooks\\Jupyter Notebooks\\Data\\simplemaps_worldcities_basicv1.76\\worldcities.csv")
city_data.head(10)

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6897,139.6922,Japan,JP,JPN,Tōkyō,primary,37732000.0,1392685764
1,Jakarta,Jakarta,-6.1750,106.8275,Indonesia,ID,IDN,Jakarta,primary,33756000.0,1360771077
2,Delhi,Delhi,28.6100,77.2300,India,IN,IND,Delhi,admin,32226000.0,1356872604
3,Guangzhou,Guangzhou,23.1300,113.2600,China,CN,CHN,Guangdong,admin,26940000.0,1156237133
4,Mumbai,Mumbai,19.0761,72.8775,India,IN,IND,Mahārāshtra,admin,24973000.0,1356226629
5,Manila,Manila,14.5958,120.9772,Philippines,PH,PHL,Manila,primary,24922000.0,1608618140
6,Shanghai,Shanghai,31.1667,121.4667,China,CN,CHN,Shanghai,admin,24073000.0,1156073548
7,São Paulo,Sao Paulo,-23.5500,-46.6333,Brazil,BR,BRA,São Paulo,admin,23086000.0,1076532519
8,Seoul,Seoul,37.5600,126.9900,South Korea,KR,KOR,Seoul,primary,23016000.0,1410836482
9,Mexico City,Mexico City,19.4333,-99.1333,Mexico,MX,MEX,Ciudad de México,primary,21804000.0,1484247881

To connect to databases:

server = 'xxxxxxxx' # Address of the database server
user = 'xxxxxx' # the username for the database server
password = 'xxxxx' # Password for the above user
database = 'xxxxx' # Database in which the table is present
conn = pymssql.connect(server=server, user=user, password=password, database=database)
query = "select * from some_table"
df = pd.read_sql(query, conn)

In [4]:
city_data.tail(10)

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
44681,Starorybnoye,Starorybnoye,72.7666,104.8000,Russia,RU,RUS,Krasnoyarskiy Kray,NaN,10.0,1643724242
44682,Sagastyr,Sagastyr,73.3779,126.5924,Russia,RU,RUS,Sakha (Yakutiya),NaN,10.0,1643535665
44683,Zemlya Bunge,Zemlya Bunge,74.8983,142.1050,Russia,RU,RUS,Sakha (Yakutiya),NaN,10.0,1643720805
44684,Agapa,Agapa,71.4504,89.2500,Russia,RU,RUS,Krasnoyarskiy Kray,NaN,10.0,1643009087
44685,Tukchi,Tukchi,57.3670,139.5000,Russia,RU,RUS,Khabarovskiy Kray,NaN,10.0,1643472801
44686,Numto,Numto,63.6667,71.3333,Russia,RU,RUS,Khanty-Mansiyskiy Avtonomnyy Okrug-Yugra,NaN,10.0,1643985006
44687,Nord,Nord,81.7166,-17.8000,Greenland,GL,GRL,NaN,NaN,10.0,1304217709
44688,Timmiarmiut,Timmiarmiut,62.5333,-42.2167,Greenland,GL,GRL,Kujalleq,NaN,10.0,1304206491
44689,San Rafael,San Rafael,-16.7795,-60.6799,Bolivia,BO,BOL,Santa Cruz,NaN,NaN,1068405265
44690,Nordvik,Nordvik,74.0165,111.5100,Russia,RU,RUS,Krasnoyarskiy Kray,NaN,0.0,1643587468

Data Access

In [5]:
series_es = city_data.lat     # lat is the column name in the city_data dataframe.
series_es[1:10:2]             # slicing from 1 to 10 skipping every second entry.

1    -6.1750
3    23.1300
5    14.5958
7   -23.5500
9    19.4333
Name: lat, dtype: float64

Slicing in Pandas series can help to access desired values.

In [6]:
series_es[:7]       # first 7 data items.
series_es[:-7315]   # excluding last 7315 items.items

0        35.6897
1        -6.1750
2        28.6100
3        23.1300
4        19.0761
          ...
37371    53.4302
37372    26.2336
37373    53.2000
37374    50.9667
37375    43.9115
Name: lat, Length: 37376, dtype: float64

Slicing in DataFrames.

- dataframe[:n] refers to [0, n) rows
- dataframe[n:] refers to [n, end) rows / all the rows from n to last.

* TO get to specific row and column we use .iloc[] *

In [7]:
city_data[:7]  # first 7 rows

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6897,139.6922,Japan,JP,JPN,Tōkyō,primary,37732000.0,1392685764
1,Jakarta,Jakarta,-6.1750,106.8275,Indonesia,ID,IDN,Jakarta,primary,33756000.0,1360771077
2,Delhi,Delhi,28.6100,77.2300,India,IN,IND,Delhi,admin,32226000.0,1356872604
3,Guangzhou,Guangzhou,23.1300,113.2600,China,CN,CHN,Guangdong,admin,26940000.0,1156237133
4,Mumbai,Mumbai,19.0761,72.8775,India,IN,IND,Mahārāshtra,admin,24973000.0,1356226629
5,Manila,Manila,14.5958,120.9772,Philippines,PH,PHL,Manila,primary,24922000.0,1608618140
6,Shanghai,Shanghai,31.1667,121.4667,China,CN,CHN,Shanghai,admin,24073000.0,1156073548

In [8]:
city_data.iloc[:5, :3]

        city city_ascii      lat
0      Tokyo      Tokyo  35.6897
1    Jakarta    Jakarta  -6.1750
2      Delhi      Delhi  28.6100
3  Guangzhou  Guangzhou  23.1300
4     Mumbai     Mumbai  19.0761

from 5-10 rows, give city, country and their iso3.
here, I have created an array of attributes and passed as an argument where .loc's column are passed.

In [9]:
city_data.loc[5:10, ['city', 'country', 'iso3']]

           city      country iso3
5        Manila  Philippines  PHL
6      Shanghai        China  CHN
7     São Paulo       Brazil  BRA
8         Seoul  South Korea  KOR
9   Mexico City       Mexico  MEX
10        Cairo        Egypt  EGY

In [10]:
city_data.loc[5:10, 'city':'country']   # 5 se 10 tak row traversal and city se country tak column traversal.

           city   city_ascii      lat       lng      country
5        Manila       Manila  14.5958  120.9772  Philippines
6      Shanghai     Shanghai  31.1667  121.4667        China
7     São Paulo    Sao Paulo -23.5500  -46.6333       Brazil
8         Seoul        Seoul  37.5600  126.9900  South Korea
9   Mexico City  Mexico City  19.4333  -99.1333       Mexico
10        Cairo        Cairo  30.0444   31.2358        Egypt

Boolean based indexing.
it allows us to work with a specific set of rows and columns.

In [11]:
# city_data where city_data's population is > 10 million.
city_data_greater_10mil = city_data[city_data['population']>10000000]

# show me city_data > 10m where its population is > 15m
city_data_greater_10mil.where(city_data_greater_10mil.population>15000000)

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6897,139.6922,Japan,JP,JPN,Tōkyō,primary,37732000.0,1.392686e+09
1,Jakarta,Jakarta,-6.1750,106.8275,Indonesia,ID,IDN,Jakarta,primary,33756000.0,1.360771e+09
2,Delhi,Delhi,28.6100,77.2300,India,IN,IND,Delhi,admin,32226000.0,1.356873e+09
3,Guangzhou,Guangzhou,23.1300,113.2600,China,CN,CHN,Guangdong,admin,26940000.0,1.156237e+09
4,Mumbai,Mumbai,19.0761,72.8775,India,IN,IND,Mahārāshtra,admin,24973000.0,1.356227e+09
5,Manila,Manila,14.5958,120.9772,Philippines,PH,PHL,Manila,primary,24922000.0,1.608618e+09
6,Shanghai,Shanghai,31.1667,121.4667,China,CN,CHN,Shanghai,admin,24073000.0,1.156074e+09
7,São Paulo,Sao Paulo,-23.5500,-46.6333,Brazil,BR,BRA,São Paulo,admin,23086000.0,1.076533e+09
8,Seoul,Seoul,37.5600,126.9900,South Korea,KR,KOR,Seoul,primary,23016000.0,1.410836e+09
9,Mexico City,Mexico City,19.4333,-99.1333,Mexico,MX,MEX,Ciudad de México,primary,21804000.0,1.484248e+09
10,Cairo,Cairo,30.0444,31.2358,Egypt,EG,EGY,Al Qāhirah,primary,20296000.0,1.818254e+09
11,New York,New York,40.6943,-73.9249,United States,US,USA,New York,NaN,18972871.0,1.840034e+09
12,Dhaka,Dhaka,23.7639,90.3889,Bangladesh,BD,BGD,Dhaka,primary,18627000.0,1.050529e+09
13,Beijing,Beijing,39.9040,116.4075,China,CN,CHN,Beijing,primary,18522000.0,1.156229e+09
14,Kolkāta,Kolkata,22.5675,88.3700,India,IN,IND,West Bengal,admin,18502000.0,1.356061e+09
15,Bangkok,Bangkok,13.7525,100.4942,Thailand,TH,THA,Krung Thep Maha Nakhon,primary,18007000.0,1.764069e+09
16,Shenzhen,Shenzhen,22.5350,114.0540,China,CN,CHN,Guangdong,minor,17619000.0,1.156159e+09
17,Moscow,Moscow,55.7558,37.6178,Russia,RU,RUS,Moskva,primary,17332000.0,1.643318e+09
18,Buenos Aires,Buenos Aires,-34.5997,-58.3819,Argentina,AR,ARG,"Buenos Aires, Ciudad Autónoma de",primary,16710000.0,1.032717e+09
19,Lagos,Lagos,6.4550,3.3841,Nigeria,NG,NGA,Lagos,minor,16637000.0,1.566594e+09
20,Istanbul,Istanbul,41.0136,28.9550,Turkey,TR,TUR,İstanbul,admin,16079000.0,1.792756e+09
21,Karachi,Karachi,24.8600,67.0100,Pakistan,PK,PAK,Sindh,admin,15738000.0,1.586129e+09
22,Bangalore,Bangalore,12.9789,77.5917,India,IN,IND,Karnātaka,admin,15386000.0,1.356410e+09
23,Ho Chi Minh City,Ho Chi Minh City,10.7756,106.7019,Vietnam,VN,VNM,Hồ Chí Minh,admin,15136000.0,1.704774e+09
24,Ōsaka,Osaka,34.6939,135.5022,Japan,JP,JPN,Ōsaka,admin,15126000.0,1.392420e+09
25,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
27,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
30,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
31,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
32,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
33,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
36,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
37,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
38,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
39,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
41,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
42,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
43,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

** Data Operations **

In [12]:
import numpy as np
# create a dataframe of [random 2d array of 8 rows, 3 columns where column names are (a, b. c)]
my_dataframe = pd.DataFrame(np.random.randn(8, 3),  columns=['A', 'B', 'C'])

# Values will create numpy ndarray from the dataframe by using *values* attribute.
np_array = my_dataframe.values
type(np_array)

numpy.ndarray

Missing Data and fillna function

In [13]:
# let's first put a NA value in the dataset.
my_dataframe.iloc[3, 2] = None
my_dataframe

          A         B         C
0 -0.454909 -0.874327  0.345850
1 -0.031454 -0.552865 -0.291332
2 -0.730932  1.467926  1.557561
3 -0.781734 -1.309284       NaN
4  0.617420  0.102758  0.703760
5  0.743364 -1.363435 -1.068972
6  1.457180  0.466872  0.121296
7  0.047953 -0.275904  0.472677

In [14]:
# Now, we will use fillna function to fill na/None/null values.
# we will substitute 0 in place of missing values.
my_dataframe.fillna(0, inplace = True) # inplace = true means don't return a new df, just do it there.
my_dataframe

          A         B         C
0 -0.454909 -0.874327  0.345850
1 -0.031454 -0.552865 -0.291332
2 -0.730932  1.467926  1.557561
3 -0.781734 -1.309284  0.000000
4  0.617420  0.102758  0.703760
5  0.743364 -1.363435 -1.068972
6  1.457180  0.466872  0.121296
7  0.047953 -0.275904  0.472677

**Descriptive Statistics Function**
We have to gather as much information about the dataset as possible.
So, pandas provides us bunch of functions for the same.

In [16]:
# mean, sum, count, median, quantile, describe
columns_numeric = ['lat', 'lng', 'population']
city_data[columns_numeric].mean()

lat               25.933692
lng               14.526105
population    114373.926145
dtype: float64

In [17]:
city_data[columns_numeric].count()

lat           44691
lng           44691
population    44384
dtype: int64

In [18]:
city_data[columns_numeric].median()

lat              32.34
lng              13.50
population    20999.00
dtype: float64

![quantile](https://i.stack.imgur.com/AXEzg.png "Quantile")

In [19]:
city_data[columns_numeric].quantile(0.8)

lat              45.9000
lng              81.2617
population    62198.2000
Name: 0.8, dtype: float64

In [24]:
# here axis = 0 or 1 means rows or columns respectively.
# axis = 1 is horizontal axis
# axis = 0 is vertical axis
city_data[columns_numeric].sum(axis = 1)
# i.e. (lat+lon+population) in row [1-n).

0        3.773218e+07
1        3.375610e+07
2        3.222611e+07
3        2.694014e+07
4        2.497309e+07
             ...
44686    1.450000e+02
44687    7.391660e+01
44688    3.031660e+01
44689   -7.745940e+01
44690    1.855265e+02
Length: 44691, dtype: float64

In [27]:
# describe function calculates most important statistics for numerical data in one go.
city_data[columns_numeric].describe()

                lat           lng    population
count  44691.000000  44691.000000  4.438400e+04
mean      25.933692     14.526105  1.143739e+05
std       23.225258     71.153080  7.148542e+05
min      -54.933300   -179.600000  0.000000e+00
25%       12.900000    -48.109750  1.218700e+04
50%       32.340000     13.500000  2.099900e+04
75%       43.333300     77.316550  4.800775e+04
max       81.716600    179.370300  3.773200e+07

**Concatinating Dataframes**
1. *Concatenation using concat method*
2. *Database style concatenation using the merge command*

In [32]:
''' 1. Concatenation using concat method '''

''' We will create a sample dataframe of random rows length 3 rows from the one we already have.'''
city1_data = city_data.sample(3)
city2_data = city_data.sample(3)
"""Now we will combine."""
combination = pd.concat([city1_data, city2_data])
combination

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
22926,Loma Linda,Loma Linda,34.0450,-117.2498,United States,US,USA,California,NaN,24712.0,1840020406
2506,Yeosu,Yeosu,34.7607,127.6622,South Korea,KR,KOR,Jeonnam,minor,273761.0,1410698161
43908,Timbedgha,Timbedgha,16.2447,-8.1675,Mauritania,MR,MRT,Hodh ech Chargui,NaN,245.0,1478847634
27209,Ajaigarh,Ajaigarh,24.8988,80.2592,India,IN,IND,Madhya Pradesh,NaN,18476.0,1356098210
43660,Victor Harbor,Victor Harbor,-35.5500,138.6167,Australia,AU,AUS,South Australia,NaN,4233.0,1036536547
42456,Petilia Policastro,Petilia Policastro,39.1167,16.7833,Italy,IT,ITA,Calabria,NaN,9073.0,1380377680

In [35]:
df1 = pd.DataFrame({'col1': ['col10', 'col11', 'col12', 'col13'], 'col2': ['col20', 'col21', 'col22', 'col23'], 'col3': ['col30', 'col31', 'col32', 'col33'], 'col4': ['col40', 'col41', 'col42', 'col43']}, index=[0, 1, 2, 3])

df1

    col1   col2   col3   col4
0  col10  col20  col30  col40
1  col11  col21  col31  col41
2  col12  col22  col32  col42
3  col13  col23  col33  col43

In [36]:
df4 = pd.DataFrame({'col2': ['col22', 'col23', 'col26', 'col27'], 'Col4': ['Col42', 'Col43', 'Col46', 'Col47'], 'col6': ['col62', 'col63', 'col66', 'col67']}, index=[2, 3, 6, 7])

df4

    col2   Col4   col6
2  col22  Col42  col62
3  col23  Col43  col63
6  col26  Col46  col66
7  col27  Col47  col67

In [41]:
# axis = 1 is horizontal axis
# axis = 0 is vertical axis
pd.concat([df1, df4], axis = 1)

    col1   col2   col3   col4   col2   Col4   col6
0  col10  col20  col30  col40    NaN    NaN    NaN
1  col11  col21  col31  col41    NaN    NaN    NaN
2  col12  col22  col32  col42  col22  Col42  col62
3  col13  col23  col33  col43  col23  Col43  col63
6    NaN    NaN    NaN    NaN  col26  Col46  col66
7    NaN    NaN    NaN    NaN  col27  Col47  col67

In [51]:
''' 2. Database style concatenation using the merge command. '''

country_data = city_data[['iso3', 'country']].drop_duplicates()

# deleting country attribute in table.
del(city_data['country'])
#merging country_data to city_data.
city_data.merge(country_data, 'inner').head(4)

,city,city_ascii,lat,lng,iso2,iso3,admin_name,capital,population,id,country
0,Tokyo,Tokyo,35.6897,139.6922,JP,JPN,Tōkyō,primary,37732000.0,1392685764,Japan
1,Ōsaka,Osaka,34.6939,135.5022,JP,JPN,Ōsaka,admin,15126000.0,1392419823,Japan
2,Nagoya,Nagoya,35.1833,136.9000,JP,JPN,Aichi,admin,9197000.0,1392407472,Japan
3,Yokohama,Yokohama,35.4442,139.6381,JP,JPN,Kanagawa,admin,3757630.0,1392118339,Japan

**Indian cities in the dataset that starts with 'F'**

In [47]:
indian_cities = city_data[city_data['country']=="India"].drop_duplicates()
indian_cities.loc[indian_cities['city'].str.startswith('F')]

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
553,Farīdābād,Faridabad,28.4167,77.3000,India,IN,IND,Haryāna,NaN,1404653.0,1356013205
2493,Farrukhābād,Farrukhabad,27.3900,79.5810,India,IN,IND,Uttar Pradesh,NaN,275754.0,1356776384
3385,Fatehpur,Fatehpur,25.9300,80.8000,India,IN,IND,Uttar Pradesh,NaN,193193.0,1356059135
3823,Fyzābād,Fyzabad,26.7730,82.1460,India,IN,IND,Uttar Pradesh,NaN,165228.0,1356032860
5483,Ferozepore,Ferozepore,30.9166,74.6000,India,IN,IND,Punjab,NaN,110313.0,1356060515
9735,Fatehpur,Fatehpur,25.5089,85.1939,India,IN,IND,Bihār,NaN,13279.0,1356353116
10746,Fatehpur Bāla,Fatehpur Bala,25.8338,85.6928,India,IN,IND,Bihār,NaN,9069.0,1356643104
12345,Farīdkot,Faridkot,30.6700,74.7600,India,IN,IND,Punjab,NaN,87695.0,1356743545
12934,Fāzilka,Fazilka,30.4030,74.0250,India,IN,IND,Punjab,NaN,76492.0,1356509839
13348,Fatehābād,Fatehabad,29.5200,75.4500,India,IN,IND,Haryāna,NaN,70777.0,1356065839
15169,Fatwa,Fatwa,25.5096,85.3050,India,IN,IND,Bihār,NaN,51047.0,1356835845
15289,Forbesganj,Forbesganj,26.3000,87.2650,India,IN,IND,Bihār,NaN,50475.0,1356077404
16156,Farrukhnagar,Farrukhnagar,17.0778,78.2011,India,IN,IND,Andhra Pradesh,NaN,45675.0,1356373389
19080,Fatehpur Sīkri,Fatehpur Sikri,27.0911,77.6611,India,IN,IND,Uttar Pradesh,NaN,32905.0,1356099769
24748,Farakka,Farakka,24.8200,87.9000,India,IN,IND,West Bengal,NaN,20126.0,1356510711
25042,Fatehgarh Chūriān,Fatehgarh Churian,31.8643,74.9567,India,IN,IND,Punjab,NaN,21007.0,1356030242
25473,Fālākāta,Falakata,26.5300,89.2000,India,IN,IND,West Bengal,NaN,19716.0,1356059125
28154,Fraserpet,Fraserpet,12.4587,75.9605,India,IN,IND,Karnātaka,NaN,17405.0,1356131799
32458,Fatehpur,Fatehpur,26.2813,87.1084,India,IN,IND,Bihār,NaN,13041.0,1356115572
33413,Fatehābād,Fatehabad,26.0652,84.9722,India,IN,IND,Bihār,NaN,11645.0,1356317360
33563,Fatehpur,Fatehpur,25.2463,87.0380,India,IN,IND,Bihār,NaN,13017.0,1356278039
34764,Fatehpur Shāhbāz,Fatehpur Shahbaz,25.5698,85.3437,India,IN,IND,Bihār,NaN,11480.0,1356045506
35445,Fakirtaki,Fakirtaki,22.3815,88.7901,India,IN,IND,West Bengal,NaN,10361.0,1356913401
35797,Falimāri,Falimari,26.3856,89.8233,India,IN,IND,West Bengal,NaN,11385.0,1356480147
36225,Fateha,Fateha,25.6073,85.8669,India,IN,IND,Bihār,NaN,9985.0,1356664955
36691,Fatehpur,Fatehpur,25.3032,87.8623,India,IN,IND,West Bengal,NaN,10423.0,1356847421
36964,Fatehpur,Fatehpur,24.6297,85.2249,India,IN,IND,Bihār,NaN,10431.0,1356495850
39322,Fatehābād,Fatehabad,31.3811,75.0996,India,IN,IND,Punjab,NaN,9992.0,1356555001
41232,Fateh Nangal,Fateh Nangal,31.9453,75.3191,India,IN,IND,Punjab,NaN,9154.0,1356102497